; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_14_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 - counter
	)
  (:init
		(= (value c0) 24)
	(= (value c1) 51)
	(= (value c2) 66)
	(= (value c3) 91)
	(= (value c4) 16)
	(= (value c5) 94)
	(= (value c6) 34)
	(= (value c7) 75)
	(= (value c8) 2)
	(= (value c9) 94)
	(= (value c10) 65)
	(= (value c11) 49)
	(= (value c12) 5)
	(= (value c13) 80)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
		)
	)
)

; plan
1. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 7 of 13
2. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 7 of 13
3. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 7 of 13
4. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 7 of 13
5. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 7 of 13
6. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 7 of 13
7. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 7 of 13
8. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 7 of 13
9. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 7 of 13
10. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 7 of 13
11. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 7 of 13
12. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 7 of 13
13. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 7 of 13
14. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 7 of 13
15. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 7 of 13
16. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 7 of 13
17. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 7 of 13
18. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 7 of 13
19. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 7 of 13
20. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 7 of 13
21. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 7 of 13
22. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 7 of 13
23. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 7 of 13
24. (increment c6)
   changed: (value c6) from 34 to 41
   goals met: 7 of 13
25. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 7 of 13
26. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 7 of 13
27. (increment c8)
   changed: (value c8) from 2 to 10
   goals met: 7 of 13
28. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 7 of 13
29. (increment c8)
   changed: (value c8) from 10 to 19
   goals met: 7 of 13
30. (increment c8)
   changed: (value c8) from 19 to 28
   goals met: 7 of 13
31. (increment c8)
   changed: (value c8) from 28 to 37
   goals met: 7 of 13
32. (increment c8)
   changed: (value c8) from 37 to 46
   goals met: 7 of 13
33. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 7 of 13
34. (increment c8)
   changed: (value c8) from 46 to 56
   goals met: 7 of 13
35. (increment c8)
   changed: (value c8) from 56 to 66
   goals met: 7 of 13
36. (increment c8)
   changed: (value c8) from 66 to 76
   goals met: 8 of 13
37. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 8 of 13
38. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 8 of 13
39. (increment c6)
   changed: (value c6) from 41 to 50
   goals met: 8 of 13
40. (increment c6)
   changed: (value c6) from 50 to 59
   goals met: 8 of 13
41. (increment c6)
   changed: (value c6) from 59 to 68
   goals met: 8 of 13
42. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 8 of 13
43. (increment c6)
   changed: (value c6) from 68 to 78
   goals met: 7 of 13
44. (decrement c5)
   changed: (value c5) from 94 to 90
   goals met: 7 of 13
45. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 7 of 13
46. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 7 of 13
47. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 7 of 13
48. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 7 of 13
49. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 7 of 13
50. (increase_rate c12)
   changed: (rate_value c12) from 5 to 6
   goals met: 7 of 13
51. (increment c12)
   changed: (value c12) from 5 to 11
   goals met: 7 of 13
52. (increase_rate c12)
   changed: (rate_value c12) from 6 to 7
   goals met: 7 of 13
53. (increase_rate c12)
   changed: (rate_value c12) from 7 to 8
   goals met: 7 of 13
54. (increment c12)
   changed: (value c12) from 11 to 19
   goals met: 7 of 13
55. (increment c12)
   changed: (value c12) from 19 to 27
   goals met: 7 of 13
56. (increment c12)
   changed: (value c12) from 27 to 35
   goals met: 7 of 13
57. (increment c12)
   changed: (value c12) from 35 to 43
   goals met: 7 of 13
58. (increment c12)
   changed: (value c12) from 43 to 51
   goals met: 8 of 13
59. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 8 of 13
60. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 8 of 13
61. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 8 of 13
62. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 8 of 13
63. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 8 of 13
64. (increment c11)
   changed: (value c11) from 49 to 54
   goals met: 7 of 13
65. (increment c12)
   changed: (value c12) from 51 to 59
   goals met: 8 of 13
66. (increase_rate c11)
   changed: (rate_value c11) from 5 to 6
   goals met: 8 of 13
67. (increment c11)
   changed: (value c11) from 54 to 60
   goals met: 7 of 13
68. (increment c12)
   changed: (value c12) from 59 to 67
   goals met: 8 of 13
69. (increment c11)
   changed: (value c11) from 60 to 66
   goals met: 9 of 13
70. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 9 of 13
71. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 9 of 13
72. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 9 of 13
73. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 9 of 13
74. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 9 of 13
75. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 9 of 13
76. (increment c10)
   changed: (value c10) from 65 to 71
   goals met: 8 of 13
77. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 8 of 13
78. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 8 of 13
79. (increment c10)
   changed: (value c10) from 71 to 77
   goals met: 8 of 13
80. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 8 of 13
81. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 8 of 13
82. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 8 of 13
83. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 8 of 13
84. (increment c11)
   changed: (value c11) from 66 to 72
   goals met: 7 of 13
85. (increment c10)
   changed: (value c10) from 77 to 87
   goals met: 7 of 13
86. (increment c12)
   changed: (value c12) from 67 to 75
   goals met: 8 of 13
87. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 8 of 13
88. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 8 of 13
89. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 8 of 13
90. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 8 of 13
91. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 8 of 13
92. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 8 of 13
93. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 8 of 13
94. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 8 of 13
95. (increment c4)
   changed: (value c4) from 16 to 25
   goals met: 8 of 13
96. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 8 of 13
97. (increment c4)
   changed: (value c4) from 25 to 35
   goals met: 8 of 13
98. (increment c4)
   changed: (value c4) from 35 to 45
   goals met: 8 of 13
99. (increment c4)
   changed: (value c4) from 45 to 55
   goals met: 8 of 13
100. (increment c4)
   changed: (value c4) from 55 to 65
   goals met: 8 of 13
101. (increment c4)
   changed: (value c4) from 65 to 75
   goals met: 8 of 13
102. (increment c4)
   changed: (value c4) from 75 to 85
   goals met: 8 of 13
103. (decrement c3)
   changed: (value c3) from 91 to 86
   goals met: 8 of 13
104. (decrement c3)
   changed: (value c3) from 86 to 81
   goals met: 9 of 13
105. (decrement c9)
   changed: (value c9) from 94 to 92
   goals met: 9 of 13
106. (decrement c9)
   changed: (value c9) from 92 to 90
   goals met: 9 of 13
107. (decrement c9)
   changed: (value c9) from 90 to 88
   goals met: 9 of 13
108. (decrement c9)
   changed: (value c9) from 88 to 86
   goals met: 10 of 13
109. (increment c6)
   changed: (value c6) from 78 to 88
   goals met: 10 of 13
110. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 10 of 13
111. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 10 of 13
112. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 10 of 13
113. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 10 of 13
114. (decrement c5)
   changed: (value c5) from 90 to 86
   goals met: 11 of 13
115. (increment c11)
   changed: (value c11) from 72 to 78
   goals met: 10 of 13
116. (increment c12)
   changed: (value c12) from 75 to 83
   goals met: 10 of 13
117. (increment c11)
   changed: (value c11) from 78 to 84
   goals met: 9 of 13
118. (increment c12)
   changed: (value c12) from 83 to 91
   goals met: 10 of 13
119. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 10 of 13
120. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 10 of 13
121. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 10 of 13
122. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 10 of 13
123. (increment c13)
   changed: (value c13) from 80 to 84
   goals met: 10 of 13
124. (increment c13)
   changed: (value c13) from 84 to 88
   goals met: 10 of 13
125. (increment c13)
   changed: (value c13) from 88 to 92
   goals met: 11 of 13
126. (increment c11)
   changed: (value c11) from 84 to 90
   goals met: 12 of 13
127. (decrement c6)
   changed: (value c6) from 88 to 78
   goals met: 11 of 13
128. (decrement c6)
   changed: (value c6) from 78 to 68
   goals met: 12 of 13
129. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 12 of 13
130. (decrement c5)
   changed: (value c5) from 86 to 81
   goals met: 11 of 13
131. (decrement c5)
   changed: (value c5) from 81 to 76
   goals met: 11 of 13
132. (decrement c5)
   changed: (value c5) from 76 to 71
   goals met: 11 of 13
133. (decrement c5)
   changed: (value c5) from 71 to 66
   goals met: 12 of 13
134. (decrement c4)
   changed: (value c4) from 85 to 75
   goals met: 11 of 13
135. (decrement c4)
   changed: (value c4) from 75 to 65
   goals met: 12 of 13
136. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 12 of 13
137. (decrement c3)
   changed: (value c3) from 81 to 75
   goals met: 12 of 13
138. (decrement c3)
   changed: (value c3) from 75 to 69
   goals met: 12 of 13
139. (decrement c3)
   changed: (value c3) from 69 to 63
   goals met: 12 of 13
140. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 12 of 13
141. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 12 of 13
142. (decrement c2)
   changed: (value c2) from 66 to 64
   goals met: 12 of 13
143. (decrement c2)
   changed: (value c2) from 64 to 62
   goals met: 13 of 13
